In [1]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')  # esto es para quitar prints

pd.set_option('display.max_columns', None)   # mostrar todas las columnas del df
#pd.set_option('display.max_rows', None)   # mostrar todas las filas del df

## 1. Importamos todos los csv y les damos un nombre para cada dataframe que creemos.

In [35]:
df_actor=pd.read_csv('../data/actor.csv')
df_actor.tail()

     actor_id first_name last_name          last_update
195       196       BELA    WALKEN  2006-02-15 04:34:33
196       197      REESE      WEST  2006-02-15 04:34:33
197       198       MARY    KEITEL  2006-02-15 04:34:33
198       199      JULIA   FAWCETT  2006-02-15 04:34:33
199       200      THORA    TEMPLE  2006-02-15 04:34:33

In [6]:
df_category=pd.read_csv('../data/category.csv')
df_category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [7]:
df_film=pd.read_csv('../data/film.csv')
df_film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [9]:
df_inventory=pd.read_csv('../data/inventory.csv')
df_inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [10]:
df_langauge=pd.read_csv('../data/language.csv')
df_langauge.head()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [11]:
df_old_HDD=pd.read_csv('../data/old_HDD.csv')
df_old_HDD.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [12]:
df_rental=pd.read_csv('../data/rental.csv')
df_rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

## 2. Limpieza df_actor

In [28]:
df_actor.info(memory_usage='deep') #comprobamos el tipo de dato y el número de nulos por columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int16
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int16(1), object(2)
memory usage: 26.6 KB

In [29]:
df_actor.last_update.unique() #check de los valores únicos de cada columna

array(['2006-02-15T04:34:33.000000000'], dtype='datetime64[ns]')

In [30]:
df_actor.last_update=pd.to_datetime(df_actor.last_update, format='%Y-%m-%d') #convertimos a tipo fecha la columna last_update

type(df_actor.last_update[0])

pandas._libs.tslibs.timestamps.Timestamp

In [38]:
#me quito la columna last_update porque sólo tiene un valor único y no aporta nada.
df_actor.drop(['last_update'], axis=1, inplace=True)

In [49]:
#Capitalizamos las columnas de nombre y apellidos
df_actor[['first_name', 'last_name']] = df_actor[['first_name', 'last_name']].apply(lambda col: col.str.capitalize())
df_actor.head()

   actor_id first_name     last_name
0         1   Penelope       Guiness
1         2       Nick      Wahlberg
2         3         Ed         Chase
3         4   Jennifer         Davis
4         5     Johnny  Lollobrigida

In [50]:
df_actor.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   actor_id    200 non-null    int16
 1   first_name  200 non-null    object
 2   last_name   200 non-null    object
dtypes: int16(1), object(2)
memory usage: 25.0 KB

In [51]:
df_actor.duplicated().any() #comprobamos valores duplicados

False

In [41]:
for c in df_actor.select_dtypes('integer').columns: #hacemos un downcast a las columna integer para reducir espacio en memoria
    
    df_actor[c]=pd.to_numeric(df_actor[c], downcast='integer')
    
df_actor.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   actor_id    200 non-null    int16
 1   first_name  200 non-null    object
 2   last_name   200 non-null    object
dtypes: int16(1), object(2)
memory usage: 25.0 KB

## 3. df_category

In [60]:
df_category.head()

   category_id       name
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

In [32]:
df_category.info(memory_usage='deep') #comprobamos el tipo de dato y el número de nulos por columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 2.4 KB

In [33]:
df_category #No vamos a hacer capitalize de name porque Sci_Fi está bien escrito así. Es una excepción.

    category_id         name          last_update
0             1       Action  2006-02-15 04:46:27
1             2    Animation  2006-02-15 04:46:27
2             3     Children  2006-02-15 04:46:27
3             4     Classics  2006-02-15 04:46:27
4             5       Comedy  2006-02-15 04:46:27
5             6  Documentary  2006-02-15 04:46:27
6             7        Drama  2006-02-15 04:46:27
7             8       Family  2006-02-15 04:46:27
8             9      Foreign  2006-02-15 04:46:27
9            10        Games  2006-02-15 04:46:27
10           11       Horror  2006-02-15 04:46:27
11           12        Music  2006-02-15 04:46:27
12           13          New  2006-02-15 04:46:27
13           14       Sci-Fi  2006-02-15 04:46:27
14           15       Sports  2006-02-15 04:46:27
15           16       Travel  2006-02-15 04:46:27

In [52]:
#me quito la columna last_update porque sólo tiene un valor único y no aporta nada.
df_category.drop(['last_update'], axis=1, inplace=True)

In [54]:
for c in df_category.select_dtypes('integer').columns: #hacemos un downcast a las columna integer para reducir espacio en memoria
    
    df_category[c]=pd.to_numeric(df_category[c], downcast='integer')
    
df_category.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int8
 1   name         16 non-null     object
dtypes: int8(1), object(1)
memory usage: 1.1 KB

## 4. df_film

In [62]:
df_film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [56]:
df_film.info(memory_usage='deep') #comprobamos el tipo de dato y el número de nulos por columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 495.3 KB

In [58]:
df_film.release_year.unique() #vamos a borrar las columnas release year y last_update

array([2006], dtype=int64)

In [68]:
df_film.release_year.unique()

array([2006], dtype=int64)

In [ ]:
df_film.release_year.unique()

In [70]:
df_film.drop(['last_update'], axis=1, inplace=True) 
df_film.drop(['release_year'], axis=1, inplace=True)

In [71]:
#Capitalizamos las columnas de título, descripción y special_features
df_film[['title', 'description', 'special_features']] = df_film[['title', 'description', 'special_features']].apply(lambda col: col.str.capitalize())
df_film.head()

,film_id,title,description,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,Academy dinosaur,A epic drama of a feminist and a mad scientist...,1,NaN,6,0.99,86,20.99,PG,"Deleted scenes,behind the scenes"
1,2,Ace goldfinger,A astounding epistle of a database administrat...,1,NaN,3,4.99,48,12.99,G,"Trailers,deleted scenes"
2,3,Adaptation holes,A astounding reflection of a lumberjack and a ...,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,deleted scenes"
3,4,Affair prejudice,A fanciful documentary of a frisbee and a lumb...,1,NaN,5,2.99,117,26.99,G,"Commentaries,behind the scenes"
4,5,African egg,A fast-paced documentary of a pastry chef and ...,1,NaN,6,2.99,130,22.99,G,Deleted scenes

In [72]:
df_film.info(memory_usage='deep') #comprobamos el tipo de dato y el número de nulos por columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   language_id           1000 non-null   int64
 4   original_language_id  0 non-null      float64
 5   rental_duration       1000 non-null   int64
 6   rental_rate           1000 non-null   float64
 7   length                1000 non-null   int64
 8   replacement_cost      1000 non-null   float64
 9   rating                1000 non-null   object
 10  special_features      1000 non-null   object
dtypes: float64(3), int64(4), object(4)
memory usage: 413.3 KB

In [73]:
#elimino también la columna de original_language_id por ser todo nulos
df_film.drop(['original_language_id'], axis=1, inplace=True)

In [74]:
df_film.info(memory_usage='deep') #comprobamos el tipo de dato y el número de nulos por columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int64
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   language_id       1000 non-null   int64
 4   rental_duration   1000 non-null   int64
 5   rental_rate       1000 non-null   float64
 6   length            1000 non-null   int64
 7   replacement_cost  1000 non-null   float64
 8   rating            1000 non-null   object
 9   special_features  1000 non-null   object
dtypes: float64(2), int64(4), object(4)
memory usage: 405.5 KB

In [75]:
df_film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,Academy dinosaur,A epic drama of a feminist and a mad scientist...,1,6,0.99,86,20.99,PG,"Deleted scenes,behind the scenes"
1,2,Ace goldfinger,A astounding epistle of a database administrat...,1,3,4.99,48,12.99,G,"Trailers,deleted scenes"
2,3,Adaptation holes,A astounding reflection of a lumberjack and a ...,1,7,2.99,50,18.99,NC-17,"Trailers,deleted scenes"
3,4,Affair prejudice,A fanciful documentary of a frisbee and a lumb...,1,5,2.99,117,26.99,G,"Commentaries,behind the scenes"
4,5,African egg,A fast-paced documentary of a pastry chef and ...,1,6,2.99,130,22.99,G,Deleted scenes

In [76]:
df_film.language_id.unique()

array([1], dtype=int64)

In [77]:
#elimino también la columna de language_id por tener sólo un valor único (1)
df_film.drop(['language_id'], axis=1, inplace=True)

In [79]:
df_film.head()

,film_id,title,description,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,Academy dinosaur,A epic drama of a feminist and a mad scientist...,6,0.99,86,20.99,PG,"Deleted scenes,behind the scenes"
1,2,Ace goldfinger,A astounding epistle of a database administrat...,3,4.99,48,12.99,G,"Trailers,deleted scenes"
2,3,Adaptation holes,A astounding reflection of a lumberjack and a ...,7,2.99,50,18.99,NC-17,"Trailers,deleted scenes"
3,4,Affair prejudice,A fanciful documentary of a frisbee and a lumb...,5,2.99,117,26.99,G,"Commentaries,behind the scenes"
4,5,African egg,A fast-paced documentary of a pastry chef and ...,6,2.99,130,22.99,G,Deleted scenes

In [78]:
df_film.info(memory_usage='deep') #comprobamos el tipo de dato y el número de nulos por columna

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int64
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   rental_duration   1000 non-null   int64
 4   rental_rate       1000 non-null   float64
 5   length            1000 non-null   int64
 6   replacement_cost  1000 non-null   float64
 7   rating            1000 non-null   object
 8   special_features  1000 non-null   object
dtypes: float64(2), int64(3), object(4)
memory usage: 397.6 KB

In [80]:
for c in df_film.select_dtypes('integer').columns: #hacemos un downcast a las columna integer para reducir espacio en memoria
    
    df_film[c]=pd.to_numeric(df_film[c], downcast='integer')
    
df_film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int16
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   rental_duration   1000 non-null   int8
 4   rental_rate       1000 non-null   float64
 5   length            1000 non-null   int16
 6   replacement_cost  1000 non-null   float64
 7   rating            1000 non-null   object
 8   special_features  1000 non-null   object
dtypes: float64(2), int16(2), int8(1), object(4)
memory usage: 379.1 KB

In [81]:
for c in df_film.select_dtypes('float').columns: #hacemos un downcast a las columnas float para reducir espacio en memoria
    
    df_film[c]=pd.to_numeric(df_film[c], downcast='float')
    
df_film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int16
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   rental_duration   1000 non-null   int8
 4   rental_rate       1000 non-null   float32
 5   length            1000 non-null   int16
 6   replacement_cost  1000 non-null   float32
 7   rating            1000 non-null   object
 8   special_features  1000 non-null   object
dtypes: float32(2), int16(2), int8(1), object(4)
memory usage: 371.3 KB

In [82]:
df_film.rating.unique()

array(['PG', 'G', 'NC-17', 'PG-13', 'R'], dtype=object)